;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Chosen common abilities: added localization
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[ChosenImmunities X2AbilityTemplate]
LocFriendlyName="天选者豁免"
LocLongDescription="免疫恐慌、眩晕和混乱."
LocHelpText="免疫恐慌、眩晕和混乱."

[ChosenKidnapMove X2AbilityTemplate]
LocFriendlyName="劫持"
LocLongDescription="劫持一个失去意识或失血的单位，获取一些关于 XCOM 下落的情报，天选者之后会离开战场."
LocHelpText="劫持一个失去意识或失血的单位，获取一些关于 XCOM 下落的情报，天选者之后会离开战场."
LocFlyOverText="劫持"

[ChosenExtractKnowledgeMove X2AbilityTemplate]
LocFriendlyName="提取知识"
LocLongDescription="运用灵能，从 一个失去意识或失血的目标中，提取有关 XCOM 的知识，天选者之后会离开战场."
LocHelpText="运用灵能，从 一个失去意识或失血的目标中，提取有关 XCOM 的知识，天选者之后会离开战场.."
LocFlyOverText="提取知识"

[ChosenSummonFollowers X2AbilityTemplate]
LocFriendlyName="召唤追随者"
LocLongDescription="召唤变种人增援部队，每场战斗只能使用一次，只能在 XCOM 未与其他敌人交战时使用."
LocHelpText="召唤变种人增援部队，每场战斗只能使用一次，只能在 XCOM 未与其他敌人交战时使用."
LocFlyOverText="召唤追随者"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Chosen Assassin abilities: added localization
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[PartingSilk X2AbilityTemplate]
LocFriendlyName="分丝"
LocLongDescription="一种将目标击退并使其晕眩的近战攻击。如果在消风状态下使用，则只有几率使目标击退并晕眩。"
LocHelpText="一种将目标击退并使其晕眩的近战攻击。如果在消风状态下使用，则只有几率使目标击退并晕眩。"
LocFlyOverText="分丝"

[VanishingWindReveal X2AbilityTemplate]
LocFriendlyName="消失的风"
LocLongDescription="变得隐形。持续到被侧翼攻击、受到伤害或使用分离丝。某些状态效果也会让你再次可见。"
LocHelpText="变得隐身。除非遭到侧翼攻击、受到伤害或使用分离丝，否则将持续存在。某些状态效果也会让你再次可见。"
LocFlyOverText="消失的风"

[DarkEventAbility_BendingReed X2AbilityTemplate]
LocFriendlyName="揭露！"
LocFlyOverText="揭晓！"

[DarkEventAbility_BendingReed X2AbilityTemplate]
LocFriendlyName="黑暗事件：弯曲芦苇"
LocFlyOverText="黑暗事件：弯曲芦苇"

[BendingReed X2AbilityTemplate]
LocFriendlyName="弯曲芦苇"
LocLongDescription="使用 分丝 后获得额外移动动作。"
LocHelpText="使用 分丝 后获得额外的移动动作。"
LocFlyOverText="弯曲芦苇"

[BendingReedPassive X2AbilityTemplate]
LocFriendlyName="弯曲芦苇"
LocLongDescription="使用 分丝 后获得额外移动动作。"
LocHelpText="使用 分丝 后获得额外的移动动作。"
LocFlyOverText="弯曲芦苇"

[MountainMistGrenade X2GrenadeTemplate]
FriendlyName="山雾"
FriendlyNamePlural="山雾"
BriefSummary="致盲单位。"
TacticalText="<Bullet/>一枚致盲手榴弹。"
ThrownAbilityName="投掷山雾"
ThrownAbilityHelpText="向目标区域投掷山雾，使范围内所有单位致盲并严重缩小其视野范围。不影响瞄准。"

[HarborWave X2AbilityTemplate]
LocFriendlyName="波浪绕射"
LocLongDescription="发射一道强大的灵能波，穿过地形。被击中的敌人有很高的几率被眩晕。"
LocHelpText="发射一道强大的灵能波，穿过地形。被击中的敌人有很高的几率被眩晕。"
LocFlyOverText="波浪绕射"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;
; 选定的猎人技能：添加了本地化
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;

[HunterConcussionGrenade X2GrenadeTemplate]
FriendlyName="震荡手榴弹"
FriendlyNamePlural="震荡手榴弹"
BriefSummary="震荡单位。"
TacticalText="<Bullet/>一枚震荡手榴弹。"
ThrownAbilityName="投掷震荡手榴弹"
ThrownAbilityHelpText="使受影响区域内的所有敌对目标眩晕并击退。"

[HunterKillzone X2AbilityTemplate]
LocFriendlyName="杀戮地带"
LocLongDescription="对任何在射击范围内移动或攻击的敌人进行反应射击。"
LocHelpText="增强了射击锥内的班组视线监视。"
LocFlyOverText="杀戮地带"

[HunterBleedingRounds X2AmmoTemplate]
FriendlyName="流血子弹"
FriendlyNamePlural="流血子弹"
BriefSummary="这些子弹的目的是使目标流血，帮助猎人击倒猎物。"
TacticalText="<Bullet/>有机会使目标流血，在其回合开始时受到伤害<br>"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;
; 选择术士技能：添加本地化
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;

[Corress X2AbilityTemplate]
LocFriendlyName="召唤幽灵僵尸"
LocHelpText="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocLongDescription="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocFlyOverText="幽灵僵尸"

[CorressM2 X2AbilityTemplate]
LocFriendlyName="召唤幽灵僵尸"
LocHelpText="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocLongDescription="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocFlyOverText="幽灵僵尸"

[CorressM3 X2AbilityTemplate]
LocFriendlyName="召唤幽灵僵尸"
LocHelpText="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocLongDescription="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocFlyOverText="幽灵僵尸"

[CorressM4 X2AbilityTemplate]
LocFriendlyName="召唤幽灵僵尸"
LocHelpText="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocLongDescription="术士根据其专注等级召唤一个或多个幽灵僵尸。幽灵僵尸将被召唤到靠近 XCOM 的位置。"
LocFlyOverText="幽灵僵尸"

; 来自 Chosen Warlock 的幽灵僵尸

[EngagePsiSelfDestruct X2AbilityTemplate]
LocFriendlyName="光谱破裂"
LocHelpText="用灵能使该单位超载，使其在后续行动中爆炸。"
LocLongDescription="使该单位承受超载灵能，使其在后续行动中爆炸。"
LocFlyOverText="光谱破裂"

[TriggerPsiSelfDestruct X2AbilityTemplate]
LocFriendlyName="触发自毁"
LocLongDescription="指示此单位在灵能爆炸中自毁，对所有附近的单位造成伤害。"
LocHelpText="指示此单位在灵能爆炸中自毁，对所有附近的单位造成伤害。"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;
; 外星统治者的共同能力：增加了本地化
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;

[AlienRulerCallForEscape X2AbilityTemplate]
LocFriendlyName="召唤之门"
LocLongDescription="召唤一个传送门离开战场。"
LocHelpText="召唤一个传送门离开战场。"
LocFlyOverText="召唤之门！"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;
; 毒蛇之王技能
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ;;;

; 这实际上是基础游戏的本地化，但他们错误地将其称为 EndBind，就像普通的 Viper 一样
[KingEndBind X2AbilityTemplate]
LocFriendlyName="解除捆绑"
LocLongDescription="如果战术情况发生变化，毒蛇可以释放其缠绕中的目标，然后将其杀死。"
LocHelpText="释放毒蛇捆绑的目标"
LocFlyOverText="发布"

[KingGetOverHere X2AbilityTemplate]
LocHelpText="用你的舌头抓住目标，将其拉至近战范围，然后立即将其勒死（如果可以使用窒息术）。只有人形目标才可以被拉动。"
